app/services/seance_service.rb

INSERT INTO "seance_templates" ("user_id", "name", "created_at", "updated_at", "exercice") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["name", "test"], ["created_at", "2024-07-17 13:33:51.179393"], ["updated_at", "2024-07-17 13:33:51.179393"], ["exercice", "[{\"name\":\"test\"},{\"name\":\"tutut\"}]"]]
INSERT INTO "exercices" ("seance_id", "name", "repetition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["seance_id", 5], ["name", "test"], ["repetition", 3], ["created_at", "2024-07-17 13:34:01.815306"], ["updated_at", "2024-07-17 13:34:01.815306"]]
INSERT INTO "seances" ("user_id", "name", "created_at", "updated_at", "exercice", "seance_template_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["name", "testg,dklgkldfkgld"], ["created_at", "2024-07-17 13:34:01.810462"], ["updated_at", "2024-07-17 13:34:01.810462"], ["exercice", "[]"], ["seance_template_id", 17]]
---
  def call
    if (!@seance_params[:seance_template_id])
      exercice_filter =  @exercices.map { |hash| hash.except("repetition") }.uniq
      seance_template = SeanceTemplate.create(user_id: @current_user.id, name: @seance_params[:name], exercice: exercice_filter)
      return [false, parent_model.errors.full_messages] unless seance_template.valid?
      template_id = seance_template.id
    else
      template_id = @seance_params[:seance_template_id]
    end

    seance = Seance.create(@seance_params.merge(seance_template_id: template_id, user_id: @current_user.id))