app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def authenticate_request
          header = request.headers["Authorization"]
          if header
              header = header.split(" ").last
              decoded = jwt_decode(header)
              @current_user = User.find(decoded[:user_id])