app/controllers/seance_templates_controller.rb

INSERT INTO "seance_templates" ("user_id", "name", "created_at", "updated_at", "exercice") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["name", "test relation"], ["created_at", "2024-07-17 13:51:30.392313"], ["updated_at", "2024-07-17 13:51:30.392313"], ["exercice", "[{\"name\":\"resr\"}]"]]
---
  def create
    @seance_template = current_user.seance_templates.build(seance_template_params)

    if @seance_template.save