app/controllers/seances_controller.rb

  def create
     @seance = @current_user.seances.new(seance_params)
      if @seance.save!
---
INSERT INTO "seances" ("user_id", "name", "created_at", "updated_at", "exercice") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "Seance lundi2"], ["created_at", "2024-02-26 16:38:18.322201"], ["updated_at", "2024-02-26 16:38:18.322201"], ["exercice", "[{\"name\":\"test\",\"repetition\":10}]"]]