app/models/seance.rb

INSERT INTO "exercices" ("seance_id", "name", "repetition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["seance_id", 24], ["name", "test"], ["repetition", 10], ["created_at", "2024-03-04 15:14:05.982874"], ["updated_at", "2024-03-04 15:14:05.982874"]]
---
  def create_exercices
    p "this is exercice :::::: "
    p self.exercice
    for exercice in self.exercice do
      p "exercice.name ::: "
      p exercice['name']
      @exercice = Exercice.new(name: exercice['name'], repetition: exercice['repetition'], seance_id: self.id)
      @exercice.save!